using UnityEngine;

namespace MatchMatch.UI.POPUP
{
    //===============================================================================================================================================
    //  게임 보드를 흔드는 코드
    //===============================================================================================================================================
    public class ScreenShacker : MonoBehaviour
    {
        #region FIELD
        // Static 함수로 Animator를 제어 할 수 있도록 static bool 변수 선언
        private static bool isShake;
        public Animator ShakerAnimator;
        #endregion

        #region PRIVATE_METHOD
        //===========================================================================================================================================
        // 매 프레임마다 isShake가 true이면, 화면 흔들기
        //===========================================================================================================================================
        private void Update()
        {
            if( isShake )
            {
                isShake = false;
                ShakerAnimator.SetTrigger("Shake");
            }
        }
        #endregion

        #region PUBLIC_METHD
        //===========================================================================================================================================
        //  게임 보드를 흔드는 함수
        //===========================================================================================================================================
        /// <summary>
        /// 게임 보드를 한 번 흔듭니다.
        /// </summary>
        public static void Shake()
        {
            isShake = true;
        }
        #endregion
    }
}